app/controllers/locations_controller.rb

SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@location = Location.find(params[:id])